app/controllers/comments_controller.rb

INSERT INTO `comments` (`text`, `tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES ('heheh', 7, 2, '2016-08-26 07:49:39', '2016-08-26 07:49:39')
---
  def create
    @comment = Comment.create(text: comment_params[:text], tweet_id: comment_params[:tweet_id], user_id: current_user.id)