app/controllers/tweets_controller.rb

SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2)
---
    def index
      @tweets = Tweet.includes(:user).page(params[:page]).per(5).order("created_at DESC")

INSERT INTO `tweets` (`image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcQjsOrN9IwkkybVGMQuwJK5WvOcwk9jTr5igTGJ5-yO0dSAh5CuDL_RB4M_', 'ああああ', 2, '2016-12-17 05:11:22', '2016-12-17 05:11:22')
---
    def create
      Tweet.create(image: tweet_params[:image], text: tweet_params[:text], user_id: current_user.id)

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 8 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 8
---
    def destroy
      tweet = Tweet.find(params[:id])
      if tweet.user_id == current_user.id
        tweet.destroy

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1
---
    def edit
      @tweet = Tweet.find(params[:id])

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1
UPDATE `tweets` SET `image` = 'http://cssslider.com/sliders/demo-5/data1/images/road_forest_trees_tree_trip_nature_leaves_season.jpg', `updated_at` = '2016-08-26 05:53:06' WHERE `tweets`.`id` = 7
---
    def update
      tweet = Tweet.find(params[:id])
      if tweet.user_id == current_user.id
        tweet.update(tweet_params)

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 7
---
    def show
      @tweet = Tweet.find(params[:id])
      @comments = @tweet.comments.includes(:user)